#!/bin/bash
# @author: hoojo
# @email: hoojo_@126.com
# @github: https://github.com/hooj0
# @create date: 2018-05-31 20:58:14
# @copyright by hoojo@2018
# @changelog Added bash `test->test string` example

# ==============================================================================
#				Shell test 命令————字符串测试
# ==============================================================================
# Shell中的 test 命令用于检查某个条件是否成立，它可以进行数值、字符和文件三个方面的测试。
# 语法：
#   test expression
# ------------------------------------------------------------------------------
# 参数					说明
# ------------------------------------------------------------------------------
# =				等于					则为真
# !=			不相等				则为真
# -z 字符串		字符串的长度为零		则为真
# -n 字符串		字符串的长度不为零	则为真
# ------------------------------------------------------------------------------



# ------------------------------------------------------------------------------
# 		实例演示：
# ------------------------------------------------------------------------------

num1="www"
num2="abc"

if test $num1 = $num2; then
    echo '两个字符串相等!'
else
    echo '两个字符串不相等!'
fi

if test $num1 != $num2; then
	echo "两个字符串不等"
fi	

str1=""
if test -z $str1; then
	echo "空字符串"
fi

if test -n $num2; then
	echo "非空字符串"
fi		

#	输出结果：
# ------------------------------------------------------------------------------
# 两个字符串不相等!