#!/bin/bash

# ======================================================================
#					流程语句————while 语句
# ======================================================================
# while循环用于不断执行一系列命令，也用于从输入文件中读取数据；

# 命令通常为测试条件。其格式为：
# ----------------------------------------------------------------------
# while condition
# do
#    command
# done
# ----------------------------------------------------------------------





# 以下是一个基本的while循环，测试条件是：
#	如果int小于等于5，那么条件返回真。
#	int从0开始，每次循环处理时，int加1。
# 运行上述脚本，返回数字1到5，然后终止。
# ----------------------------------------------------------------------

int=1
while(( $int<=5 ))
do
    echo $int
    let "int++"
done


# 运行脚本，输出：
# ----------------------------------------------------------------------
# 1
# 2
# 3
# 4
# 5


# 代码中使用了 Bash let 命令，它用于执行一个或多个表达式，
#	变量计算中不需要加上 $ 来表示变量，具体可查阅：Bash let 命令
# ----------------------------------------------------------------------
a=1
b=3
c=-1
let "c=a+b"
echo "c: $c"


# while循环可用于读取键盘信息。下面的例子中，
#	输入信息被设置为变量FILM，按<Ctrl-D>结束循环。
# ----------------------------------------------------------------------

echo '按下 <CTRL-D> 退出'
echo -n '输入你最喜欢的网站名: '
while read FILM
do
    echo "是的！$FILM 是一个好网站"
done


# 运行脚本，输出类似下面：
# ----------------------------------------------------------------------

# 按下 <CTRL-D> 退出
# 输入你最喜欢的网站名: baidu
# 是的！baidu 是一个好网站